app/views/plant_sectors/_form.html.erb


    <%= form.select :plant_id, Plant.all.collect { |p| [ p.name, p.id ] }, {}, class: 'browser-default' %>
---
SELECT "plants".* FROM "plants"