app/views/greenhouses/index.html.erb

<%= @greenhouse.id %>
<%= @greenhouse.plant_sectors.count %>
---
SELECT  "plants".* FROM "plants" WHERE "plants"."plant_sector_id" = ? LIMIT ?  [["plant_sector_id", 4], ["LIMIT", 1]]
SELECT "plant_sectors".* FROM "plant_sectors" WHERE "plant_sectors"."greenhouse_id" = ?  [["greenhouse_id", 1]]
SELECT COUNT(*) FROM "plant_sectors" WHERE "plant_sectors"."greenhouse_id" = ?  [["greenhouse_id", 1]]