app/controllers/greenhouses_controller.rb

  def index
  	@action_entries = ActionEntry.all
---
SELECT "action_entries".* FROM "action_entries"