app/controllers/plant_sectors_controller.rb

INSERT INTO "plant_sectors" ("created_at", "updated_at", "plant_id", "greenhouse_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-10-10 19:16:31.643422"], ["updated_at", "2017-10-10 19:16:31.643422"], ["plant_id", 1], ["greenhouse_id", 1]]
---
  def create
    @plant_sector = PlantSector.new(plant_sector_params)
    @plant_sector.greenhouse_id = @greenhouse.id

    respond_to do |format|
      if @plant_sector.save

UPDATE "plant_sectors" SET "plant_id" = ?, "updated_at" = ?, "elapsed_time" = ? WHERE "plant_sectors"."id" = ?  [["plant_id", 1], ["updated_at", "2017-10-12 23:07:44.574281"], ["elapsed_time", 0], ["id", 1]]
---
  def update
    respond_to do |format|
      if @plant_sector.update(plant_sector_params)

DELETE FROM "plant_sectors" WHERE "plant_sectors"."id" = ?  [["id", 1]]
---
  def destroy
    @plant_sector.destroy

SELECT  "plant_sectors".* FROM "plant_sectors" WHERE "plant_sectors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_plant_sector
      @plant_sector = PlantSector.find(params[:id])