app/controllers/plants_controller.rb

  def index
    @plants = Plant.all
---
SELECT "plants".* FROM "plants"

  def create
    @plant = Plant.new(plant_params)

    respond_to do |format|
      if @plant.save
---
INSERT INTO "plants" ("name", "soil_moisture", "magnesium", "potassium", "iron", "temperature", "humidity", "hours_of_light", "growth_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @plant.update(plant_params)
---
UPDATE "plants" SET "magnesium" = ?, "potassium" = ?, "iron" = ?, "temperature" = ?, "humidity" = ?, "hours_of_light" = ?, "growth_time" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["magnesium", 50], ["potassium", 3], ["iron", 3], ["temperature", 3], ["humidity", 3], ["hours_of_light", 3], ["growth_time", 3], ["updated_at", "2017-10-11 21:38:18.697875"], ["id", 1]]

  def destroy
    @plant.destroy
---
DELETE FROM "plants" WHERE "plants"."id" = ?  [["id", 3]]

    def set_plant
      @plant = Plant.find(params[:id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]