app/controllers/xtreme_farm_bot_controller.rb

	def work


		# luz

		if (Greenhouse.first.turn_on_light_time = Time.now.hour)
			LightManagement.turn_on()
		elsif (Greenhouse.first.turn_off_light_time = Time.now.hour)
			LightManagement.turn_off()
		end

		# ventilar

		VentilationManagement.start_fan()
		sleep 0.1
		VentilationManagement.stop_fan()

		if (PlagueSensor.sense() == 1)
			InsecticideIrrigation.irrigate()
		end

		prom_tempe = 0
		prom_humi = 0

		PlantSector.all.each do | sector |
---
SELECT "plant_sectors".* FROM "plant_sectors"


		# temperatura

		prom_tempe /= PlantSector.count
---
SELECT COUNT(*) FROM "plant_sectors"

		def environment_aging
			PlantSector.all.each do | sector |
---
SELECT "plant_sectors".* FROM "plant_sectors"